Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: རྣམ་པར་དཔྱོད་པ་དེ་དག་ཀྱང་མི་གནས་པ། གནས་པ་མེད་པ། རྣམ་པར་རིག་པ་མེད་པའོ། །
en: Investigations and analyses of its source and location reveal it to be unfindable, groundless, and unknowable.

source: ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན། དེ་བཞིན་གཤེགས་པའི་གསུང་འབྱུང་བ་གང་ཡིན་པ་དང་། གཞན་སེམས་ཅན་རྣམས་ཀྱི་ངག་གང་ཡིན་པ་དེ་ཐམས་ཅད་ཀྱང་མེད་པ། གསོག །བརྫུན་པ།
en: Therefore, lord of nāgas, whatever speech of the Thus-Gone One arises, as well as the speech of other beings, is all nonexistent, unreal, false, and deceptive conditioned phenomena.”

source: སླུ་བའི་ཆོས་ཅན་ནོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་གསུང་བ་མ་ལགས་སམ།
en: “Blessed One, does the Thus-Gone One not speak truthfully?”

source: བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་དེ་དེ་བཞིན་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་ཡང་དག་པར་གསུང་བའོ། །
en: “Indeed, lord of nāgas, a thus-gone one does speak truthfully.

source: དེ་བཞིན་གཤེགས་པས་འདུས་བྱས་ཐམས་ཅད་ནི་མ་བྱུང་བར་མཁྱེན་ཏེ། ཇི་ལྟར་མཁྱེན་པ་དེ་བཞིན་དུ་དེ་སྟོན་ཏོ། །
en: Because a thus-gone one understands that all compounded phenomena are unarisen, and he teaches in accordance with that understanding.

source: དོན་འདིས་ན་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པ་གསུང་བའོ། །
en: In this sense, a thus-gone one speaks truthfully.

source: ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་གསུང་ཡི་གེ་ལ་དཔྱོད་པ་གང་ཡིན་པའི་ཡི་གེ་དེ་དག་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་དཔྱོད་དེ།
en: “Lord of nāgas, all beings analyze the speech of the Thus-Gone One literally.

source: དེ་བས་ན་སེམས་ཅན་ཐམས་ཅད་ནི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཡང་ཆོས་ཀྱི་ངོ་བོ་ཉིད་མི་ཤེས་སོ། །
en: That is why, even though the wheel of Dharma has been turned, they still do not understand the essence of the Dharma.

source: དེའི་ཕྱིར་དེ་དག་ཡི་གེ་ལ་དཔྱོད་པ་ནི་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་བྱ་བའི་ཕྱིར་འབྱུང་བ་མ་ཡིན་ནོ། །
en: That is why their analysis of the words does not lead to the full exhaustion of the suffering it makes.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ནི་སྒྲ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་ཏོ། །
en: Lord of nāgas, childish ordinary beings can fixate on any words in this way.

source: དེ་དག་ནི་ཐ་སྙད་ཐམས་ཅད་ལ་ཡང་ཉོན་མོངས་པ་རྣམས་དང་མ་འདྲེས་པའི་ངག་འབྱུང་ངོ་། །
en: All the conventional expressions of speech arise untainted by afflictions.

source: དེ་དག་ཉོན་མོངས་ཀྱང་ཀུན་ནས་ཉོན་མོངས་པས་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་ནི་མ་ཡིན་ནོ། །
en: Even the word affliction has neither been nor will be afflicted by afflictions.

source: ངག་ལ་དཔྱོད་ཅིང་རྣམ་པར་བྱང་བར་བྱེད་ཀྱང་ཆོས་ཉིད་ཀྱི་རང་བཞིན་གྱིས་རྣམ་པར་དག་པར་འགྱུར་བ་མ་ཡིན་ཏེ།
en: Whether speech is analyzed as being pure, it does not affect its intrinsically pure true nature.

source: ཀླུའི་བདག་པོ་འདི་ནི་ངག་ཡོངས་སུ་དག་པ་ཞེས་བྱའོ། །
en: Lord of nāgas, that is known as the purity of speech.

source: དེ་ལ་སེམས་ཡོངས་སུ་དག་པ་གང་ཞེ་ན།
en: “What is the purity of mind?

source: སེམས་ཀྱི་རང་བཞིན་ནི་ཀུན་ནས་ཉོན་མོངས་པར་བྱ་བར་མི་ནུས་སོ། །
en: The nature of the mind cannot be afflicted.

source: སེམས་ནི་རང་བཞིན་གྱིས་འོད་གསལ་ཡང་དེ་ནི་གློ་བུར་གྱི་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་ཉེ་བར་ཉོན་མོངས་སོ། །
en: The mind is by nature luminosity, yet it is subject to sudden affliction, and by proximity to affliction it becomes further afflicted.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་གློ་བུར་གྱི་ཉེ་བའི་ཉོན་མོངས་པ་རྣམས་ཀྱི་སྐབས་མི་འབྱེད་དེ།
en: Bodhisattvas give no opportunity for those temporary afflictions to arise.

source: དེ་རང་བཞིན་གྱིས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་སེམས་ཀྱི་ལས་གང་གིས་དགེ་བའི་རྩ་བ་དེ་དག་ལ་སོགས་པའི་སེམས་དེ་ཡང་སེམས་ཀྱི་རང་བཞིན་ཉིད་དུ་རབ་ཏུ་ཤེས་སོ། །
en: They understand that naturally pure mental acts that gather roots of virtue are mind’s very nature.

source: སེམས་ཀྱི་ལས་གང་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པས་ཁྱབ་པར་བྱེད་པའི་སེམས་དེ་ཡང་སེམས་དང་མཉམ་པ་ཉིད་དུ་རབ་ཏུ་ཤེས་སོ། །
en: They understand that mental acts that radiate love to all beings are the same as the mind.

source: སེམས་ཀྱི་ལས་གང་གིས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བའི་སེམས་དེ་ཡང་བྱང་ཆུབ་དང་མཉམ་པ་ཉིད་དུ་རབ་ཏུ་ཤེས་སོ། །
en: They understand that mental acts that dedicate all roots of virtue toward awakening are the same as awakening.

source: དེ་ལྟར་སེམས་ཡོངས་སུ་དག་པ་འདོད་ཆགས་ལ་སྤྱོད་པ་ཐམས་ཅད་དང་ལྷན་ཅིག་གནས་ཀྱང་འདོད་ཆགས་ཀྱི་དྲི་མས་ཀུན་ཏུ་གོས་པར་མི་འགྱུར་རོ། །དེ་བཞིན་དུ་ཞེ་སྡང་ལ་སྤྱོད་པ་དང་།
en: In this way, although those of pure mind may coexist with those who engage in lustful behavior, they are not in any way polluted by the stains of desire.

source: གཏི་མུག་ལ་སྤྱོད་པ་དང་། ཆ་མཉམ་པ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་དང་ལྷན་ཅིག་གནས་ཤིང་འདུག་ཀྱང་དེ་དག་གི་དྲི་མས་ཀུན་ཏུ་གོས་པར་མི་འགྱུར་རོ། །
en: Likewise, though they may coexist with those who behave with aversion, delusion, or all afflictions in equal measure, they are not polluted by those stains.

source: དེ་ལྟར་སེམས་ཡོངས་སུ་དག་པ་དེ་འདོད་པའི་ཁམས་སུ་སྐྱེ་སྟེ། གཟུགས་ན་སྤྱོད་པའི་ཚངས་པ་རབ་ཏུ་ཞི་བའི་སྤྱོད་ལམ་ཅན་རྣམས་དང་ལྷན་ཅིག་གནས་ཤིང་འདུག་ཀྱང་དེ་དག་གི་ཟིལ་གྱིས་གནོན་མི་ནུས་ཀྱི།
en: In the same way, even when those with pure minds are born in the desire realm, they cannot be outshone by the peaceful brahmās of the form realm.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ཉིད་ཀྱིས་ལྷ་དེ་དག་ཟིལ་གྱིས་གནོན་ཏོ། །
en: Rather, it is the bodhisattvas who outshine the gods.

source: དེ་ལྟར་སེམས་ཡོངས་སུ་དག་པ་དེ་གཟུགས་ཀྱི་ཁམས་སུ་སྐྱེས་ལ་འདོད་པའི་ཁམས་ཀྱི་སེམས་ཅན་རྣམས་དང་ལྷན་ཅིག་ཏུ་གནས་ཤིང་འདུག་ཀྱང་ཡོངས་སུ་སྐྱོ་བ་མི་སྐྱེད་ཅིང་བདག་བརྗོད་པས་སེམས་ཅན་དེ་དག་ལ་བརྙས་པའི་སེམས་མི་སྐྱེད་དོ། །
en: Likewise, even when those with pure minds are born into the form realm and coexist with beings of the desire realm, they do not become disheartened. Nor do they despise those beings who assert a self.

source: དེ་ལྟར་སེམས་ཡོངས་སུ་དག་པ་དེ་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་སྙོམས་པར་ཞུགས་ཀྱང་དེ་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་དབང་གིས་མི་སྐྱེའོ། །
en: In the same way, if those with a pure mind rest evenly in all the absorptions and attainments, they will not be reborn through the power of those concentrations and absorptions.

source: ཀླུའི་བདག་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔར་དེའི་སེམས་ངེས་པར་སེམས་པ་ཐབས་མཁས་པས་མངོན་པར་སྒྲུབ་པའི་ཕྱིར་རོ། །
en: Because, lord of nāgas, bodhisattvas reach accomplishment through their skillful expertise in ascertaining the mind.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་དག་པའི་ལམ་འདི་ལ་སྒོམ་པ་རྣམ་པར་དག་པའི་སྤྱོད་པ་ལ་མཁས་པ་ཡིན་ནོ། །
en: Likewise, lord of nāgas, bodhisattvas who cultivate this path of purity are expert in pure conduct.

source: ཀླུའི་བདག་པོ་དངོས་པོ་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན། དངོས་པོ་རྣམ་པར་འཇིག་པས་ལམ་སྒོམ་པ་མ་ཡིན།
en: Lord of nāgas, the path is not cultivated by meditating on entities, nor by destroying them.

source: དངོས་པོ་ཁས་ལེན་པ་མ་ཡིན། དངོས་པོ་ཁས་མི་ལེན་པས་ལམ་སྒོམ་པ་མ་ཡིན།
en: The path is not cultivated by asserting entities, nor by denying them.

source: དངོས་པོ་སྲིད་པས་མ་ཡིན། དངོས་པོ་མི་སྲིད་པས་ལམ་སྒོམ་པ་མ་ཡིན།
en: The path is not cultivated through the existence of entities, nor through the nonexistence of entities.

source: དངོས་པོ་སྐྱེ་བས་མ་ཡིན། དངོས་པོ་འགག་པས་ལམ་སྒོམ་པ་མ་ཡིན།
en: The path is not cultivated by the arising of entities, nor by the cessation of entities.

source: དངོས་པོ་འཛིན་པས་མ་ཡིན། དངོས་པོ་འདོར་བས་ལམ་སྒོམ་པ་མ་ཡིན། བདག་ཏུ་མ་ཡིན།
en: The path is not cultivated by grasping entities, nor by rejecting entities.

source: བདག་མེད་པར་མ་ཡིན། སེམས་ཅན་དུ་མ་ཡིན། སྲོག་ཏུ་མ་ཡིན། གསོ་བར་མ་ཡིན། སྐྱེས་བུར་མ་ཡིན། གང་ཟག་ཏུ་མ་ཡིན།
en: The path is not cultivated by meditating on a self, the lack of a self, a being, a life force, a soul, a person, an individual, humanity, or a human being.

source: ཤེད་ལས་སྐྱེས་སུ་མ་ཡིན། ཤེད་བུ་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན། ཕུང་པོ་མི་རྟག་པར་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན། ཕུང་པོ་སྡུག་བསྔལ་བར་སྒོམ་པས་མ་ཡིན། ཕུང་པོ་བདག་མེད་པར་སྒོམ་པས་མ་ཡིན།
en: The path is not cultivated by meditating on the aggregates as impermanence, by meditating on the aggregates as suffering, by meditating on the aggregates as being without self, by meditating on the aggregates as peace, or by meditating on the aggregates as free from desire.

source: ཕུང་པོ་ཞི་བར་སྒོམ་པས་མ་ཡིན། ཕུང་པོ་འདོད་ཆགས་དང་བྲལ་བར་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན། ཕུང་པོ་སྒྱུ་མ་ལྟ་བུར་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན། ཕུང་པོ་རྨི་ལམ་ལྟ་བུར་སྒོམ་པས་མ་ཡིན། ཕུང་པོ་མིག་ཡོར་ལྟ་བུར་སྒོམ་པས་མ་ཡིན།
en: Nor is the path cultivated by meditating on the aggregates as being like illusions, by meditating on the aggregates as being like dreams, by meditating on the aggregates as being like hallucinations, or by meditating on the aggregates as being like echoes.

source: ཕུང་པོ་བྲག་ཅ་ལྟ་བུར་སྒོམ་པས་མ་ཡིན། ཕུང་པོ་སྟོང་པ་ཉིད་དུ་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན། ཕུང་པོ་མཚན་མ་མེད་པར་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན། ཕུང་པོ་སྨོན་པ་མེད་པར་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན་ནོ། །
en: Nor is the path cultivated by meditating on the aggregates as emptiness, by meditating on the aggregates as being beyond signs, or by meditating on the aggregates as being beyond wishes.

source: འདི་ལྟར་གང་སྟོང་པ་དེ་ནི་དངོས་པོ་མ་ཡིན། དངོས་པོ་མེད་པ་མ་ཡིན་ནོ། །
en: Because that which is empty is neither an entity nor a nonentity.

source: གང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དེ་ནི་དངོས་པོ་མ་ཡིན། དངོས་པོ་མེད་པ་མ་ཡིན་ཏེ།
en: That which is beyond signs and beyond wishes is neither an entity nor a nonentity.

source: འདི་ནི་ལམ་སྒོམ་པ་ཞེས་བྱའོ། །
en: This is known as the cultivation of the path.

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན།
en: This path is not cultivated by meditating on the aggregates, on the elements, or on the sense sources.

source: མ་རིག་པ་ལ་འདོད་ཆགས་དང་བྲལ་བར་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན་པ་ནས་རྒ་ཤིའི་བར་ལ་འདོད་ཆགས་དང་བྲལ་བར་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན་ནོ། །
en: It not cultivated by meditating on being free of attachment to ignorance, up to not cultivated by meditating on being free of attachment to old age and death.

source: དེ་བཞིན་དུ་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དང་། ཟག་པ་དང་བཅས་པ་དང་།
en: Similarly, it is not cultivated by meditating on the mundane or the supramundane, on the compounded or the uncompounded, on the defiled or the undefiled, or on the flawed or the flawless.

source: ཟག་པ་མེད་པ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་སྒོམ་པས་ལམ་སྒོམ་པ་མ་ཡིན་ཏེ། ཀླུའི་བདག་པོ་གང་ཆོས་ཐམས་ཅད་དངོས་པོར་ཡང་མི་བྱེད། དངོས་པོ་མེད་པར་ཡང་མི་བྱེད་པ་འདི་ནི་ལམ་སྒོམ་པ་ཞེས་བྱའོ། །
en: Lord of nāgas, not imputing any phenomena as entities or as nonentities is known as the cultivation of the path.

source: ཆོས་ཐམས་ཅད་ལ་མི་གནས་པར་སྒོམ་པ་དང་། བླང་བ་མེད་པ་དང་དོར་བ་མེད་པར་སྒོམ་པ་འདི་ནི་ལམ་སྒོམ་པ་ཞེས་བྱའོ། །
en: Meditating on all phenomena as nonabiding, without accepting them and without rejecting them, is known as the cultivation of the path.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་པར་དག་པའི་ལམ་སྒོམ་པའི་ཡོན་ཏན་གྱི་ལེའུ་འདི་བཤད་པའི་ཚེ་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་ལས་སྲོག་ཆགས་དགུ་ཁྲི་ཉིས་སྟོང་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །སྲོག་ཆགས་ཁྲི་ཉིས་སྟོང་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །སྲོག་ཆགས་བདུན་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: As this discourse on teaching the qualities of cultivating the pure path was being given by the Blessed One, ninety-two thousand beings from among those assembled purified the Dharma eye so that phenomena became spotless and immaculate; twelve thousand beings reached concordant acceptance; and seven thousand beings reached acceptance of the unborn nature of phenomena.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་གིས་རྣམ་པར་དག་པའི་ལམ་སྒོམ་པ་འདི་མཉན་ཏེ་ཐོས་ནས་མི་དངང་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་ལ་འཛིན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཛིན་པར་འགྱུར་རོ། །
en: Then the whole assembly exclaimed in unison, “Blessed One, those noble sons and daughters who have listened to this teaching on cultivating the pure path and, having heard it, have comprehended it and remembered it without fear will attain the unsurpassed, perfect awakening of the Thus-Gone One!

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་བསྐོར་བའི་ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་སུ་སྐོར་བར་འགྱུར་རོ། །
en: They will turn the wheel of Dharma that the Thus-Gone One turns!

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་དཀོན་མཆོག་རྗེས་སུ་སྲུང་བར་འགྱུར་རོ། །
en: They will protect the rare jewel of the Thus-Gone One’s sacred Dharma!

source: དེ་དག་ནི་སེང་གེའི་ཁྲི་ལ་འདུག་ཅིང་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ད་ལྟར་བསྒྲགས་པ་དེ་བཞིན་དུ་སེང་གེའི་སྒྲ་སྒྲོགས་པར་འགྱུར་རོ། །
en: They will sit on the lion throne and roar like lions, just as the thus-gone, worthy, unsurpassed, perfect Buddha does now!

source: དེ་དག་ནི་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཕམ་པར་བྱེད་པར་འགྱུར་རོ། །
en: They will conquer the legions of Māra!

source: དེ་དག་ནི་ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཚར་ཆོད་པར་འགྱུར་རོ། །
en: They will eliminate all adversaries!

source: དེ་དག་ནི་ཆོས་ཀྱི་ཏོག་སྒྲེང་བར་འགྱུར་རོ། །
en: They will raise the flag of the Dharma!

source: དེ་དག་ནི་ཆོས་ཀྱི་སྒྲོན་མེ་འབར་བར་བྱེད་པར་འགྱུར་རོ། །
en: They will make the lamp of the Dharma blaze!

source: དེ་དག་ནི་ཆོས་ཀྱི་དུང་རབ་ཏུ་འབུད་པར་འགྱུར་རོ། །
en: They will blow the conch of the Dharma!

source: དེ་དག་ནི་ཆོས་ཀྱི་རྔ་རྡུང་བར་འགྱུར་རོ། །
en: They will beat the drum of the Dharma!

source: དེ་དག་ནི་ཆོས་ཀྱི་ཆར་འབེབས་པར་འགྱུར་རོ། །
en: They will bring down a rain of Dharma!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་དེ་དག་དང་། འཁོར་བཞི་པོ་དེ་དག་གིས་ལེགས་པར་སྨྲས་པ་ལ་རྗེས་སུ་ཡི་རང་བ་མཛད་ནས། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། དངོས་པོར་འདུ་ཤེས་གང་གིས་ཀྱང་། །ལམ་བསྒོམ་ནུས་པ་མ་ཡིན་ཏེ། །
en: Then the Blessed One rejoiced in the well-spoken words of the nāgas and the fourfold assembly and spoke these verses to the nāga king Anavatapta: “Those who conceive of entities Cannot cultivate this path.

source: ལམ་འདི་ལ་ནི་འདི་ལྟ་བུར། །དངོས་པོར་འདུ་ཤེས་ཡོད་མ་ཡིན། །དངོས་པོ་དངོས་པོར་བྱེད་པས་མིན། །
en: On this path, therefore, There is no notion of entities.

source: དངོས་མེད་དངོས་པོ་མེད་བྱེད་པས། །ནམ་མཁའ་རྣམ་དག་གང་འདྲ་བའི། །ལམ་བསྒོམ་ནུས་པ་མ་ཡིན་ནོ། །
en: “This path is pure like the sky— It cannot be cultivated While apprehending Either entities or nonentities.

source: གང་ཞིག་ལམ་ནི་དངོས་བྱེད་མིན། །དངོས་མེད་དངོས་པོ་མེད་བྱེད་མིན། །དངོས་དང་དངོས་མེད་བྲལ་བ་དེ། །མཆོག་གི་ལམ་ནི་སྒོམ་པའོ། །
en: “Those who do not apprehend this path In terms of entities or nonentities, Those who are free from such concepts, Are those who cultivate the supreme path.

source: བདག་ཏུ་ལམ་སྒོམ་མ་ཡིན་ལ། །བདག་མེད་སྒོམ་པས་མ་ཡིན་ཏེ། །
en: “This path is not cultivated In terms of self or the absence of self.

source: འདི་ལྟར་གཉིས་སུ་མེད་པའི་ལམ། །གྲུབ་ཅིང་བདེ་བ་བླ་ན་མེད། །
en: This path of nonduality Brings unsurpassed happiness.

source: དེ་བཞིན་སྲོག་དང་གསོ་བ་དང་། །གང་ཟག་ཀྱང་ནི་དེ་བཞིན་ཏེ། །གང་ཟག་མེད་པའི་ལམ་འདི་ནི། །སྲོག་མེད་རབ་ཏུ་གནས་པ་མེད། །
en: “The same applies to life force, Soul, and individuality; On this path, there is no individual, There is no life force, and nothing is established.

source: སྟོང་པ་ཉིད་ལ་གནས་ནས་སུ། །གང་དག་ལ་ལ་ལམ་སྒོམ་པ། །དེ་དག་འཕགས་པའི་ལམ་ལས་རིང་། །དེ་དག་ལམ་སྒོམ་མ་ཡིན་ནོ། །
en: “Those who cultivate the path While fixating on emptiness Are far from the noble path— They are not cultivating this path.

source: སྟོང་པ་ཉིད་ལ་ལམ་མེད་དེ། །ལམ་སྒོམ་པ་ཡང་ཡོད་མ་ཡིན། །
en: “In emptiness there is no path, Nor any cultivation of the path.

source: དེ་ལྟར་མཚན་ཉིད་གཅིག་པ་ནི། །མཐའ་འདས་སྟོང་པ་སྟོང་པ་ཉིད། །
en: Its single characteristic is that It is beyond extremes—empty of emptiness.

source: སྐྱེ་བའི་མཚན་ཉིད་ལམ་མ་ཡིན། །མཚན་ཉིད་མེད་པའང་དེ་མ་ཡིན། །གང་ཞིག་མ་སྐྱེས་མི་འགོག་པ། །
en: “The characteristic of arising is not the path, Nor is the absence of such a characteristic, And that which is unborn is unceasing.

source: དེ་ནི་ལམ་སྒོམ་ཡིན་པར་གསུངས། །
en: That is said to be the cultivation of the path.

source: ཕུང་པོ་ལྔ་ནི་སྒྱུ་མ་ལྟར། །གང་གིས་འདུ་ཤེས་འཇུག་པ་དང་། །དངོས་པོར་འཛིན་པའི་འདུ་ཤེས་ཅན། །ལམ་ལ་སྒོམ་པ་ག་ལ་ཡིན། །
en: “The five aggregates are like illusions; How could those who entertain notions And hold on to the concept of entities Cultivate the path?

source: ལམ་འདི་འཇིག་རྟེན་འདས་པ་སྟེ། །འདི་ལ་ཕུང་པོ་དངོས་མེད་ན། །ཕུང་པོ་རྣམ་པར་འཇིག་པའི་ཕྱིར། །སྒོམ་པར་ནུས་པ་མ་ཡིན་ནོ། །
en: “This path transcends the world; Since the aggregates are unreal And subject to destruction, They cannot be cultivated.

source: ཕུང་པོའི་དེ་བཞིན་ཉིད་དེ་ནི། །དེ་བཞིན་ཉིད་དུ་རབ་ཏུ་བསྟན། །དེ་བཞིན་ཁོ་ན་དེ་ལ་ནི། །གཞན་དུ་འགྱུར་བ་མི་དམིགས་སོ། །
en: “The nature of the aggregates Is taught to be thusness, And that thusness Cannot transform into something else.

source: དེ་བཞིན་ཉིད་ནི་ལམ་སྒོམ་མིན། །དེ་ལ་ཡོད་དང་མེད་པ་མཉམ། །
en: “Thusness is not the cultivation of a path; In it, existence and nonexistence are the same.

source: དེ་བཞིན་ཉིད་ལ་དེ་བཞིན་ཤེས། །དེ་ནི་ལམ་ལ་སྒོམ་པ་ཡིན། །
en: One should know thusness in that way— That is the cultivation of the path.

source: ཆོས་རྣམས་ཀུན་ནི་དེ་བཞིན་ཉིད། །
en: “All phenomena are thusness.

source: ངས་ནི་དེ་ལྟར་སངས་རྒྱས་ཏེ། །
en: I have awakened in that way.

source: དེ་ཉིད་རྟོགས་པར་བྱ་བའི་ཕྱིར། །ལམ་ལ་སྒོམ་པར་བྱེད་པ་ཡིན། །
en: On the path one meditates In order to realize just that.

source: གང་ཞིག་ལམ་ནི་མི་ཤེས་བཞིན། །ལྷག་པར་བྱེད་ལའང་མ་ཞུགས་པ། །སངས་རྒྱས་ཆོས་རྣམས་ཚོལ་བ་ན། །
en: “When those who do not know the path, And are not particularly engaged, Seek the Buddha’s teachings, They will be hindered by obstacles.

source: དེ་ལ་ཐོགས་པ་འབྱུང་བར་འགྱུར། །ངས་ནི་ཇི་ལྟར་ལམ་བསྒོམས་ཤིང་། །ཇི་ལྟ་བུར་ནི་རེག་པ་ལྟར། །དེ་བཞིན་ཉིད་ལ་གནས་ནས་སུ། །དེ་ལྟར་དེ་ནི་བཤད་པར་བྱ། །
en: “While remaining in thusness, I will explain How I have cultivated the path And how I came to touch it.

source: ཐེག་པ་དམན་པ་འབྱུང་བའི་ཕྱིར། །ལམ་འདི་ཚད་དང་བཅས་པ་ཡིན། །
en: “For reaching the emancipation of the Lower Vehicle, This path is sufficient.

source: ཐེག་པ་ཆེན་པོ་འབྱུང་བའི་ཕྱིར། །འདི་ནི་ལམ་གྱི་དམ་པ་ཡིན། །
en: For reaching the emancipation of the Great Vehicle, This path is supreme.

source: གང་དག་ལ་ལ་ལམ་ཐོབ་ལ། །ཐོབ་ནས་རྒྱུན་འཆད་མི་བྱེད་པ། །དེ་དང་དེ་དག་ལམ་ཐོབ་སྟེ། །ལམ་བསྒོམ་པ་ནི་སྒོམ་པར་བྱེད། །
en: “Some attain the path And, having attained it, do not cease; For those who have attained the path, To cultivate the path is to meditate.

source: མཉམ་སྟེ་མི་མཉམ་མེད་པའི་ལམ། །རྣལ་དུ་འདུག་ཅིང་དྲང་ཤེས་པ། །ངན་པའི་ལམ་ཀུན་རྣམ་སྤངས་ནས། །བྱང་ཆུབ་རྗེས་སུ་ཐོབ་པར་བྱེད། །ཇི་ལྟར་ཀླུ་ཡི་རྒྱལ་པོ་ཁྱོད། །རང་གི་གནས་ན་འདུག་བྱེད་ཅིང་། །གནས་ནས་གཡོས་པ་མེད་པར་ཡང་། །
en: “It is the path of neither sameness nor non-sameness, Of resting in naturalness and knowing integrity, Of abandoning all bad ways, And reaching awakening as a result.

source: རྒྱ་མཚོ་འདི་ནི་གང་བར་བྱེད། །དེ་ལྟར་སེམས་ཅན་ཆེན་པོ་དག །ལམ་བསྒོམ་པ་ནི་བསྒོམས་ནས་སུ། །ཆོས་ཀྱི་དབྱིངས་ལས་མ་གཡོས་པར། །ཡེ་ཤེས་རྒྱ་མཚོ་འགེངས་པར་བྱེད། །ཇི་ལྟར་ཀླུ་ཡི་རྒྱལ་པོ་ཁྱོད། །ས་རྣམས་འདི་དག་ཐམས་ཅད་ལ། །
en: “King of nāgas, Just as you remain in your abode Without moving from it And yet fill the ocean, “So do great beings Who have meditated to cultivate the path Fill an ocean of wisdom Without stirring from the realm of phenomena.

source: ཆུ་ཡི་རྒྱུན་གྱིས་ངོམས་བྱེད་ཀྱང་། །དེ་ནི་ནང་ན་གནས་པ་མེད། །དེ་ལྟར་སེམས་ཅན་ཆེན་པོ་དག །བསྒོམ་པ་འདི་ལ་བསྒོམས་ནས་ནི། །སེམས་ཅན་ཆོས་ཀྱིས་ཚིམ་བྱེད་ཀྱང་། །ནང་ན་གནས་པ་མ་ཡིན་ནོ། །
en: “King of nāgas, Just as you saturate all these lands With the flow of rivers Yet the water does not remain, “So do great beings Who have meditated to cultivate this Satiate beings with the Dharma Yet not remain among them.

source: ཇི་ལྟར་ཀླུ་ཡི་རྒྱལ་པོ་ཁྱོད། །ཕ་རོལ་གནོན་པས་གདུང་བ་མེད། །དེ་ལྟར་དཔའ་བོ་ལམ་ཐོབ་པ། །ཉོན་མོངས་པས་ནི་གདུང་བ་མེད། །
en: “King of nāgas, Just as you are unharmed by opponents, Those who have attained the path of the heroes Are unharmed by afflictions.

source: སེམས་ཅན་གང་དག་ལྟ་གནས་ཤིང་། །ལོག་པའི་ལམ་དུ་ལྟུང་བ་དག །ལམ་འདི་ལ་ནི་རབ་གནས་ན། །དེ་དག་མྱ་ངན་འདའ་བར་འགྱུར། །
en: “If those who hold views And fall into wrong paths Stay on this path, They will pass beyond suffering.

source: ལམ་འདི་ལ་ནི་གནས་ནས་སུ། །བྱང་ཆུབ་སེམས་དཔའ་གྲགས་ཆེན་པོ། །བདུད་སྡིག་ཅན་དང་དེ་བཞིན་དུ། །ཕ་རོལ་མུ་སྟེགས་ཅན་རྣམས་འདུལ། །
en: “Those who abide on this path With the great renown of bodhisattvas Will tame the evil Māra And non-Buddhist opponents.

source: གང་ཚེ་ལམ་ནི་ཐོབ་གྱུར་པ། །དེ་ཚེ་གཡོ་བ་མེད་པར་འགྱུར། །
en: “The moment this path is attained, They become unshakable.

source: འཇིག་རྟེན་ཆོས་རྣམས་ཟིལ་མནན་ནས། །པད་མ་ལྟ་བུར་རབ་ཏུ་སྤྱོད། །
en: Outshining worldly phenomena, They come forth like lotuses.

source: བྱང་ཆུབ་སེམས་ལས་མ་ཉམས་ཤིང་། །ལམ་འདི་ལ་ནི་མཉམ་གཞག་པ། །སེམས་ཅན་གཞན་རྣམས་སྟོང་དག་ཀྱང་། །བྱང་ཆུབ་ལ་ནི་རབ་ཏུ་འཛུད། །
en: “Having settled evenly on this path With the unabating intention to reach awakening, They lead thousands of other beings To the state of awakening.

source: ལམ་འདི་ལ་ནི་རབ་གནས་པ། །མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་ནས། །རྫུ་འཕྲུལ་ཐམས་ཅད་རྣམ་སྤྲུལ་ཞིང་། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: “Those who stay on this path Achieve the five higher perceptions And teach the Dharma to beings While manifesting all kinds of miraculous powers.

source: དེ་དག་ལུས་དང་ངག་དང་ཡིད། །ཐམས་ཅད་དུ་ནི་ཡོངས་དག་ཅིང་། །བསམ་གྱིས་མི་ཁྱབ་སེམས་ཅན་ཁམས། །འཕགས་པའི་ལམ་ལ་རབ་ཏུ་འཛུད། །
en: “With completely pure Body, speech, and mind, They lead inconceivable realms of beings Onto the path of the noble ones.

source: དམིགས་པ་མེད་པའི་བཟོད་པ་གང་། །རིག་རྟོགས་ཁོང་དུ་ཆུད་རྟོགས་པ། །དེ་བཞིན་གཤེགས་ཀྱི་རྟོགས་ཐོབ་ནས། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: “Those who have realized Acceptance without reference points, Who have reached the realization of the thus-gone, Reveal the Dharma to beings.

source: འཇིག་རྟེན་འདི་འགྲོ་གང་ཡིན་པ། །དེ་བཞིན་གཤེགས་འགྲོ་དེ་ཡིན་ཏེ། །
en: “The way of the world Is the way of the thus-gone.

source: དེ་དག་ཁོང་དུ་ཆུད་རྟོགས་ན། །དེ་དག་འགྲོ་བ་མེད་པར་འགྱུར། །
en: Those who comprehend this Will not be reborn.

source: སེམས་ཅན་ཀུན་གྱི་འགྲོ་གང་ཡིན། །དེ་དག་འགྲོ་བ་ངེས་འགྲོ་ཞིང་། །
en: “The way of all beings Certainly leads to rebirth.

source: སངས་རྒྱས་ཆོས་འདིར་བསླབས་ནས་སུ། །སྒྱུ་མའི་ཆོས་ཀྱིས་རྣམ་པར་སྤྲུལ། །
en: Those who train in the qualities of the Buddha Manifest in an illusory manner.

source: ཇི་ལྟར་ལམ་ནི་འདི་སྒོམ་ཞིང་། །གང་དག་ལམ་ལ་སྒོམ་བྱེད་པ། །དེ་དག་སྔགས་དང་ཡོན་ཏན་རྣམས། །འདྲེན་པ་དག་ནི་ཀུན་གྱིས་གསུངས། །
en: “All the guides proclaim The praises and qualities Of the way this path is cultivated And of those who cultivate it.

source: དེ་དག་གི་ནི་ཡོན་ཏན་མཐའ། །བརྒྱ་ལམ་ན་ཡང་རྟོགས་མི་ནུས། །གང་དག་ལམ་ནི་འདི་སྒོམ་པ། །དེ་དག་དངོས་པོ་མེད་ལ་གནས། །
en: “The extent of those qualities Can hardly be conceived; Those who cultivate this path Abide in the absence of entities.

source: གང་དག་མི་སྐྱེ་མི་འབྱུང་བའི། །ལམ་འདི་ལ་ནི་རབ་ཞུགས་པ། །དེ་ལ་དམིགས་ཅན་ཐམས་ཅད་དང་། །བདུད་ཀྱིས་གཏིང་དཔོགས་མ་ཡིན་ནོ། །
en: “Those immersed in this path, The path of the unborn and unarisen, Cannot be fathomed by Māra Or by those who hold to reference points.

source: དེ་དག་གུས་བཅས་དྲན་པ་དང་། །བློ་གྲོས་རྟོགས་དང་གཟུངས་རྣམས་དང་། །སྤོབས་པ་ཐོབ་ཅིང་ཚུལ་ཁྲིམས་དང་། །ཐོས་དང་གཏོང་བས་རྣམ་པར་འཕེལ། །
en: “With devotion and mindfulness, With intelligence, understanding, and retention, And with eloquence, their discipline, Learning, and generosity flourish.

source: གང་དག་ལམ་ནི་འདི་སྒོམ་པ། །ལུས་དག་ཅིང་ནི་ངག་དག་ལ། །སེམས་དག་ཤིན་ཏུ་སྦྱངས་པ་རྣམས། །རབ་དག་ཤིན་ཏུ་རྣམ་པར་དག །
en: “Those who cultivate this path, Who have purified Body, speech, and mind, Are utterly pure and flawless.

source: གང་དག་ལམ་ནི་འདི་སྒོམ་པ། །འཕགས་པའི་རྟོགས་པ་རྗེས་འཐོབ་ཅིང་། །ཟབ་མོའི་ཚུལ་ལ་མཁས་པ་སྟེ། །ཆགས་མེད་ཡེ་ཤེས་འཁྲུལ་པ་མེད། །
en: “Those who cultivate this path, Who, attaining the understanding of the noble ones, Are experts in the profound way, Have no confusion about unimpeded wisdom.

source: གང་དག་འདས་པའི་སངས་རྒྱས་དང་། །གང་དག་མ་འོངས་ད་ལྟར་བྱུང་། །རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད། །ལམ་ཐོབ་པས་ནི་མཆོད་པ་ཡིན། །
en: “By attaining this path, They honor All the perfect buddhas Of the past, future, and present.

source: མདོ་སྡེ་འདི་ལ་གང་དགའ་བ། །སེམས་ཅན་དེ་སྙེད་ལེགས་པར་རྙེད། །དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོང་། །དེ་དག་དམ་ཆོས་རབ་ཏུ་ཐོས། །
en: “Those who delight in this discourse Are extremely fortunate; They will behold the thus-gone ones And hear the sacred Dharma from them.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་བསྟན་པས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ། ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the Blessed One had given the teaching, the nāga king Anavatapta was satisfied, pleased, delighted, and joyous.
